#include <iostream>
#include <windows.h>
using namespace std;
int main()
{
SetConsoleOutputCP(1251);
cout<<"Тази програма извежда всички трицифрени числа, сумата от цифрите на които е просто число."<<endl;
    //Максималният сбор на трите числа е 9*3=27. Простите числа до 27 са: 3,5,7,11,13,17,19,21,23 и 27.
    //Да знам, че може да се реши програмата и с оператори за повторение, но става твърде дълго за толкова проста задача.
    //С оператори ще се реши като трите цифри ги съберем и проверим дали са прости като ги разделим с цикъл, който е от 2 до поломината от дрfгото число...става много дълго и...
    //...програмата става по-тежка. За това програмата ще я реша така.
 int a,b,c;
 for(int q=100;q<1000;q++)
 {
 a=q%10;
 b=q/10%10;
 c=q/100;
 int d=a+b+c;
 switch(d)
 {
 case 2 :cout<<q<<", ";
 break;
 case 3 :cout<<q<<", ";
 break;
 case 5 :cout<<q<<", ";
 break;
 case 7 :cout<<q<<", ";
 break;
 case 11:cout<<q<<", ";
 break;
 case 13:cout<<q<<", ";
 break;
 case 17:cout<<q<<", ";
 break;
 case 19:cout<<q<<", ";
 break;
 case 23:cout<<q<<", ";
 break;
 }
 }
 return 0;
}
